`
קובץ לפונקציות חישוב ועזר למערכת
`
import rl from 'readline-sync'

` תוספת מגניבה לתצוגה - נכתב על ידי ובהתייעצות עם AI`
export const formatCurrency = (amount) => `₪${anount.toFixed(2)}`


export function menu()
{
  console.log
(`
=====================תפריט מערכת ניהול החשבון=====================
1. הוספת לקוח חדש   (קלט נדרש : שם, סוג חשבון, יתרה התחלתית)    
2. הצגת רשימת כלל לקוחות הבנק                                  ()
3. הפקדת כסף   (קלט נדרש : מזהה יחודי , סכום)                    
4. משיכת כסף   (קלט נדרש : מזהה יחודי , סכום)                    
5. חיפוש לקוח  (קלט נדרש : מזהה ייחודי או שם)                    
6. סגירת חשבון  (קלט נדרש : מזהה ייחודי)                         
7. הצגת סטטיסטיקות                                              ()
8. יציאה                                                           
===================================================================
`)
    return rl.questionInt('     =================Choose (1-9)!=================\n')
}




















// export function isPositive(num) {
//   return num > 0
// }


// module.exports = {
//   isPositive
// }

